{
  "fes": {
    "autoplay": "El contenido que se intent칩 reproducir (de '{{src}}'), no fue permitido en este navegador, posiblemente por las reglas de reproducci칩n autom치tica.\n\n Para m치s informaci칩n: {{url}}.",
    "checkUserDefinedFns": "Es posible que accidentalmente hayas escrito {{name}} en lugar de {{actualName}}. Por favor corr칤jelo si no fue intencional.",
    "fileLoadError": {
      "bytes": "Parece que hubo un problema cargando tu archivo. {{suggestion}}",
      "font": "Parece que hubo un problema cargando tu fuente. {{suggestion}}",
      "gif": "There was some trouble loading your GIF. Make sure that your GIF is using 87a or 89a encoding.",
      "image": "Parece que hubo un problema cargando tu imagen. {{suggestion}}",
      "json": "Parece que hubo un problema cargando tu archivo JSON. {{suggestion}}",
      "large": "Si tu archivo no se est치 cargando exitosamente, te recomendamos dividirlo en segmentos m치s peque침os.",
      "strings": "Parece que hubo un problema cargando tu archivo de texto. {{suggestion}}",
      "suggestion": "Intenta validar si la ruta del archivo ({{filePath}}) es correcta, hosteando el archivo online, o corriendo un servidor local.\n\n+ M치s informaci칩n: {{url}}",
      "table": "Parece que hubo un problema cargando tu archivo de tabla. {{suggestion}}",
      "xml": "Parece que hubo un problema cargando tu archivo XML. {{suggestion}}"
    },
    "friendlyParamError": {
      "type_EMPTY_VAR": "{{location}} {{func}}() esperaba {{formatType}} para el {{position}} par치metro, pero recibi칩 una variable vac칤a. Si no fue intencional, usualmente es un problema con el 치mbito de la variable.\n\n+ M치s informaci칩n: {{url}}",
      "type_TOO_FEW_ARGUMENTS": "{{location}} {{func}}() esperaba al menos {{minParams}} argumentos, pero s칩lo recibi칩 {{argCount}}.",
      "type_TOO_MANY_ARGUMENTS": "{{location}} {{func}}() esperaba no m치s de {{maxParams}} argumentos, pero recibi칩 {{argCount}}.",
      "type_WRONG_TYPE": "{{location}} {{func}}() esperaba {{formatType}} para el {{position}} par치metro, pero recibi칩 {{argType}} en su lugar."
    },
    "globalErrors": {
      "reference": {
        "cannotAccess": "\n{{location}} \"{{symbol}}\" es usada antes de ser inicializada. Aseg칰rate de haber declarado la variable antes de usarla.\n\n+ M치s informaci칩n: {{url}}",
        "notDefined": "\n{{location}} \"{{symbol}}\" no est치 definida en el 치mbito actual. Si la definiste en tu c칩digo, revisa el 치mbito, ortograf칤a y el uso de may칰sculas y min칰sculas (JavaScript distingue entre may칰sculas y min칰sculas).\n\n+ M치s informaci칩n: {{url}}"
      },
      "stackSubseq": "較[{{location}}] \n\t Llamado desde la l칤nea {{line}} en {{func}}()\n",
      "stackTop": "較[{{location}}] \n\t Error en la l칤nea {{line}} en {{func}}()\n",
      "syntax": {
        "badReturnOrYield": "\nError de sintaxis - return se encuentra fuera de una funci칩n. Aseg칰rate de que no te faltan ningunas llaves para que el return est칠 dentro de una funci칩n.\n\n+ M치s informaci칩n: {{url}}",
        "invalidToken": "\nError de sintaxis - Se encontr칩 un s칤mbolo que JavaScript no reconoce o no espera en ese lugar.\n\n+ M치s informaci칩n: {{url}}",
        "missingInitializer": "\nError de sintaxis - Una variable constante es declarada pero no inicializada. En JavaScript, se requiere un inicializador para las constantes. Un valor debe ser especificado en la misma declaraci칩n donde se declara la variable. Revisa el n칰mero de l칤nea en el error y asigna un valor a la constante.\n\n+ M치s informaci칩n: {{url}}",
        "redeclaredVariable": "\nError de sintaxis - \"{{symbol}}\" est치 siendo redeclarado. JavaScript no permite declarar una variable m치s de una vez. Revisa el n칰mero de l칤nea en el error para encontrar la redeclaraci칩n de la variable.\n\n+ M치s informaci칩n: {{url}}",
        "unexpectedToken": "\nError de sintaxis - Se encontr칩 s칤mbolo en un lugar donde no se esperaba.\nUsualmente esto es debido a un error de escritura. Revisa el n칰mero de l칤nea en el error por algo faltante/extra.\n\n+ M치s informaci칩n: {{url}}"
      },
      "type": {
        "constAssign": "\n{{location}} Una variable constante est치 siendo reasignada. En JavaScript, reasignar un valor a una constante no es permitido. Si quieres reasignar nuevos valores a una variable, aseg칰rate de declararla como var o let.\n\n+ M치s informaci칩n: {{url}}",
        "notfunc": "\n{{location}} \"{{symbol}}\" no se pudo llamar como una funci칩n.\nRevisa ortograf칤a, el uso de may칰sculas y min칰sculas (JavaScript distingue entre may칰sculas y min칰sculas) y el tipo.\n\n+ M치s informaci칩n: {{url}}",
        "notfuncObj": "\n{{location}} \"{{symbol}}\" no puso ser llamada como una funci칩n.\nVerifica si \"{{obj}}\" tiene \"{{symbol}}\" dentro y revisa ortograf칤a, el uso de may칰sculas y min칰sculas (JavaScript distingue entre may칰sculas y min칰sculas) y el tipo.\n\n+ M치s informaci칩n: {{url}}",
        "readFromNull": "\n{{location}} No se pudo leer la propiedad de null. En JavaScript el valor null indica que un objeto no tiene valor.\n\n+ M치s informaci칩n: {{url}}",
        "readFromUndefined": "\n{{location}} No se pudo leer la pripiedad de indefinido. Revisa el n칰mero de l칤nea y aseg칰rate de que la variable que est치 siendo usada est칠 definida.\n\n + M치s informaci칩n: {{url}}"
      }
    },
    "libraryError": "{{location}} Un error con el mensaje \"{{error}}\" ocurri칩 dentro de la librer칤a p5js cuando se llam칩 {{func}}. Si no se indica lo contrario, podr칤a ser un problema con los argumentos pasados a {{func}}.",
    "location": "[{{file}}, l칤nea {{line}}]",
    "misspelling": "{{location}} Parece que pudiste haber escrito accidentalmente \"{{name}}\" en lugar de \"{{actualName}}\". Por favor corr칤gelo a {{actualName}} si quieres usar el {{type}} de p5.js.",
    "misspelling_plural": "{{location}} Parece que pudiste haber escrito accidentalmente \"{{name}}\".\nQuiz치s quisiste decir alguna de las siguientes opciones: \n{{suggestions}}",
    "misusedTopLevel": "쯊rataste de usar {{symbolName}} {{symbolType}}? de p5.js?, Quiz치s debas mover tu sketch dentro de la funci칩n setup().\n\n+ M치s informaci칩n: {{url}}",
    "positions": {
      "p_1": "primero",
      "p_10": "d칠cimo",
      "p_11": "und칠cimo",
      "p_12": "duod칠cimo",
      "p_2": "segundo",
      "p_3": "tercero",
      "p_4": "cuarto",
      "p_5": "quinto",
      "p_6": "sexto",
      "p_7": "s칠ptimo",
      "p_8": "octavo",
      "p_9": "noveno"
    },
    "pre": "\n游꺚 p5.js dice: {{message}}",
    "sketchReaderErrors": {
      "reservedConst": "Has usado una variable reservada de p5.js \"{{symbol}}\" aseg칰rate de cambiar el nombre de la variable por uno distinto.\n\n+ M치s informaci칩n: {{url}}",
      "reservedFunc": "Has usado una funci칩n reservada de p5.js \"{{symbol}}\" aseg칰rate de cambiar el nombre de la funci칩n por uno distinto.\n\n+ M치s informaci칩n: {{url}}"
    },
    "welcome": "춰Bienveni@! este es tu debugger amigable. Para apagarme, usa p5.min.js.",
    "wrongPreload": "{{location}} An error with message \"{{error}}\" occurred inside the p5js library when \"{{func}}\" was called. If not stated otherwise, it might be due to \"{{func}}\" being called from preload. Nothing besides load calls (loadImage, loadJSON, loadFont, loadStrings, etc.) should be inside the preload function."
  }
}
